source/_posts/2017-03-02-linux-poll.org
#+TITLE: linux poll分析
#+DATE: 2017-03-02
#+SETUPFILE: ../../org/setupfile.org
#+LAYOUT: post
#+CATEGORIES: Linux
#+TAGS: Kernel Driver

在上层应用中使用系统调用，最终都会调用到内核中提供的接口，对于 ~poll~ ，与之相对应的即为 ~sys_poll~ 函数。

