source/_posts/2017-03-02-linux-poll.html
---
title: "linux poll分析"
date: 2017-03-02
layout: post
categories: 
- Linux
tags: 
- Kernel 
- Driver
published: true
comments: 
---
<p>
在上层应用中使用系统调用，最终都会调用到内核中提供的接口，对于 <code>poll</code> ，与之相对应的即为 <code>sys_poll</code> 函数。
</p>
