source/_posts/2017-03-02-linux-poll.org
* sys_poll

sys_poll函数的实现在内核中的 [[http://lxr.free-electrons.com/source/fs/select.c#L971][fs/select.c]] 文件中:
#+BEGIN_SRC C
  SYSCALL_DEFINE3(poll, struct pollfd __user *, ufds, unsigned int, nfds,
                  int, timeout_msecs)
  {
      ...

      /* 在这里调用do_sys_poll */
      ret = do_sys_poll(ufds, nfds, to);

      ...
  }
#+END_SRC

{{{more}}}


可以看看 ~SYSCALL_DEFINE3~ 是如何展开得到 ~sys_poll~ 函数的定义的

#+BEGIN_SRC C
  #define SYSCALL_DEFINE3(name, ...) SYSCALL_DEFINEx(3, _##name, __VA_ARGS__)

  #define __SYSCALL_DEFINEx(x, name, ...)                             \
      asmlinkage long sys##name(__MAP(x,__SC_DECL,__VA_ARGS__))       \
          __attribute__((alias(__stringify(SyS##name))));             \
      static inline long SYSC##name(__MAP(x,__SC_DECL,__VA_ARGS__));	\
      asmlinkage long SyS##name(__MAP(x,__SC_LONG,__VA_ARGS__));      \
      asmlinkage long SyS##name(__MAP(x,__SC_LONG,__VA_ARGS__))       \
      {                                                               \
          long ret = SYSC##name(__MAP(x,__SC_CAST,__VA_ARGS__));      \
          __MAP(x,__SC_TEST,__VA_ARGS__);                             \
          __PROTECT(x, ret,__MAP(x,__SC_ARGS,__VA_ARGS__));           \
          return ret;                                                 \
      }                                                               \
      static inline long SYSC##name(__MAP(x,__SC_DECL,__VA_ARGS__))
#+END_SRC

~SYSCALL_DEFINE3(poll, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs)~ 通过宏展开后:

#+BEGIN_SRC C
  /* 给sys_poll起的别名为Sys_poll */
  asmlinkage long sys_poll(__MAP(3, __SC_DECL, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs))
      __attribute__((alias(__stringify(SyS_poll))));
  static inline long SYSC_poll(__MAP(3, __SC_DECL, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs));

  /* Sys_poll函数将参数类型强转为long类型 */
  asmlinkage SyS_poll(__MAP(3, __SC_LONG, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs));
  asmlinkage SyS_poll(__MAP(3, __SC_LONG, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs))
  {

      /* 将参数类型强转为对应的实际类型，并调用下面实现的SYSC_poll函数 */
      long ret = SYSC_poll(__MAP(3, __SC_CAST, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs));
      __MAP(3, __SC_TEST, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs);
      __PROTECT(3, ret, __MAP(3, __SC_ARGS, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs));
      return ret;
  }
  static inline long SYSC_poll(__MAP(3, __SC_DECL, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs))
#+END_SRC

那么<span id="inline-yellow">__MAP</span>  <span id="inline-purple">__SC_CAST</span>  <span id="inline-blue">__SC_DECL</span> 以及 <span id="inline-green">__SC_LONG</span>
这些宏又是如何实现的：


#+BEGIN_SRC C
  #define __MAP(n,...) __MAP##n(__VA_ARGS__)

  #define __MAP1(m,t,a) m(t,a)
  #define __MAP2(m,t,a,...) m(t,a), __MAP1(m,__VA_ARGS__)
  #define __MAP3(m,t,a,...) m(t,a), __MAP2(m,__VA_ARGS__)

  #define __SC_DECL(t, a)	t a

  /********************************************************************************************************************/
  /* 对于__MAP(3, __SC_DECL, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs)                    */
  /* 展开后即为 __SC_DECL(struct pollfd __user *, ufds), __MAP2(__SC_DECL, unsigned int, nfds, int, timeout_msecs)    */
  /* 进一步展开 __SC_DECL(struct pollfd __user *, ufds), __SC_DECL(unsigned int, nfds), __SC_DECL(int, timeout_msecs) */
  /* 最终即为 struct pollfd __user * ufds, unsigned int nfds, int timeout_msecs                                       */
  /********************************************************************************************************************/

#+END_SRC

可见__MAP和__SC_DECL宏的主要作用是进行参数类型和参数的配对，而当和__SC_LONG配对使用时就是将所有的参数类型强转为long类型进行接受，
这样转来转去为了啥？原因就是64位linux系统下有个名为CVE-2009-2009的漏洞，ABI规定在64位平台的在系统调用时，必须确保用户空间将系统
调用中32位的参数存放在64位的寄存器中并保证正确的符合扩展，但是用户空间程序并不能保证做到这点，这就有可能向有漏洞的系统调用传送特制
参数导致系统崩溃或者权限提升。

#+BEGIN_QUOTE
ABI: Application Binary Interface, 定义了的内容大概有：
1. 数据类型的大小，布局和对齐方式。
2. 控制函数的参数如何进行传递以及如何接受返回值，例如，通过栈还是部分通过寄存器等。
3. 应用如何使用系统调用。
4. 目标文件的二进制格式，程序库等。
#+END_QUOTE

