source/_posts/2017-03-02-linux-poll.html

<div id="orgee31658" class="outline-2">
<h2 id="orgee31658">sys_poll</h2>
<div class="outline-text-2" id="text-orgee31658">
<p>
sys_poll函数的实现在内核中的 <a href="http://lxr.free-electrons.com/source/fs/select.c#L971">fs/select.c</a> 文件中:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #f99157;">SYSCALL_DEFINE3</span><span style="color: #cccccc;">(</span>poll, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds,
                <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    ...

    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#22312;&#36825;&#37324;&#35843;&#29992;do_sys_poll </span><span style="color: #999999; font-style: italic;">*/</span>
    ret = <span style="color: #f99157;">do_sys_poll</span><span style="color: #66cccc;">(</span>ufds, nfds, to<span style="color: #66cccc;">)</span>;

    ...
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
<!-- more -->
</p>


<p>
可以看看 <code>SYSCALL_DEFINE3</code> 是如何展开得到 <code>sys_poll</code> 函数的定义的
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">SYSCALL_DEFINE3</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">name</span>, ...<span style="color: #cccccc;">)</span> <span style="color: #f99157;">SYSCALL_DEFINEx</span><span style="color: #cccccc;">(</span><span style="color: #6699cc;">3</span>, _##name, __VA_ARGS__<span style="color: #cccccc;">)</span>

<span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__SYSCALL_DEFINEx</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">x</span>, <span style="color: #ffcc66;">name</span>, ...<span style="color: #cccccc;">)</span>                             \
    asmlinkage <span style="color: #6699cc;">long</span> <span style="color: #f99157;">sys</span>##<span style="color: #f99157;">name</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_DECL,__VA_ARGS__<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>       \
        <span style="color: #f99157;">__attribute__</span><span style="color: #cccccc;">(</span><span style="color: #66cccc;">(</span><span style="color: #f99157;">alias</span><span style="color: #ffcc66;">(</span><span style="color: #f99157;">__stringify</span><span style="color: #99cc99;">(</span>SyS##name<span style="color: #99cc99;">)</span><span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;             \
    <span style="color: #99cc99;">static</span> <span style="color: #99cc99;">inline</span> <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SYSC</span>##<span style="color: #f99157;">name</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_DECL,__VA_ARGS__<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;  \
    asmlinkage <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SyS</span>##<span style="color: #f99157;">name</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_LONG,__VA_ARGS__<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;      \
    asmlinkage <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SyS</span>##<span style="color: #f99157;">name</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_LONG,__VA_ARGS__<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>       \
    <span style="color: #cccccc;">{</span>                                                               \
        <span style="color: #6699cc;">long</span> <span style="color: #ffcc66;">ret</span> = SYSC##<span style="color: #f99157;">name</span><span style="color: #66cccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #ffcc66;">(</span>x,__SC_CAST,__VA_ARGS__<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;      \
        <span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_TEST,__VA_ARGS__<span style="color: #66cccc;">)</span>;                             \
        <span style="color: #f99157;">__PROTECT</span><span style="color: #66cccc;">(</span>x, ret,<span style="color: #f99157;">__MAP</span><span style="color: #ffcc66;">(</span>x,__SC_ARGS,__VA_ARGS__<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;           \
        <span style="color: #99cc99;">return</span> ret;                                                 \
    <span style="color: #cccccc;">}</span>                                                               \
    <span style="color: #99cc99;">static</span> <span style="color: #99cc99;">inline</span> <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SYSC</span>##<span style="color: #f99157;">name</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span>x,__SC_DECL,__VA_ARGS__<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>
</pre>
</div>

<p>
<code>SYSCALL_DEFINE3(poll, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs)</code> 通过宏展开后:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#32473;sys_poll&#36215;&#30340;&#21035;&#21517;&#20026;Sys_poll </span><span style="color: #999999; font-style: italic;">*/</span>
asmlinkage <span style="color: #6699cc;">long</span> <span style="color: #f99157;">sys_poll</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_DECL, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>
    <span style="color: #f99157;">__attribute__</span><span style="color: #cccccc;">(</span><span style="color: #66cccc;">(</span><span style="color: #f99157;">alias</span><span style="color: #ffcc66;">(</span><span style="color: #f99157;">__stringify</span><span style="color: #99cc99;">(</span>SyS_poll<span style="color: #99cc99;">)</span><span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;
<span style="color: #99cc99;">static</span> <span style="color: #99cc99;">inline</span> <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SYSC_poll</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_DECL, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;

<span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">Sys_poll&#20989;&#25968;&#23558;&#21442;&#25968;&#31867;&#22411;&#24378;&#36716;&#20026;long&#31867;&#22411; </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #6699cc;">asmlinkage</span> <span style="color: #f99157;">SyS_poll</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_LONG, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>;
<span style="color: #6699cc;">asmlinkage</span> <span style="color: #f99157;">SyS_poll</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_LONG, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>

    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#23558;&#21442;&#25968;&#31867;&#22411;&#24378;&#36716;&#20026;&#23545;&#24212;&#30340;&#23454;&#38469;&#31867;&#22411;&#65292;&#24182;&#35843;&#29992;&#19979;&#38754;&#23454;&#29616;&#30340;SYSC_poll&#20989;&#25968; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #6699cc;">long</span> <span style="color: #ffcc66;">ret</span> = <span style="color: #f99157;">SYSC_poll</span><span style="color: #66cccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #ffcc66;">(</span><span style="color: #6699cc;">3</span>, __SC_CAST, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;
    <span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_TEST, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span>;
    <span style="color: #f99157;">__PROTECT</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, ret, <span style="color: #f99157;">__MAP</span><span style="color: #ffcc66;">(</span><span style="color: #6699cc;">3</span>, __SC_ARGS, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;
    <span style="color: #99cc99;">return</span> ret;
<span style="color: #cccccc;">}</span>
<span style="color: #99cc99;">static</span> <span style="color: #99cc99;">inline</span> <span style="color: #6699cc;">long</span> <span style="color: #f99157;">SYSC_poll</span><span style="color: #cccccc;">(</span><span style="color: #f99157;">__MAP</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">3</span>, __SC_DECL, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *, ufds, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span>, nfds, <span style="color: #6699cc;">int</span>, timeout_msecs<span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>
</pre>
</div>

那么<span id="inline-yellow">__MAP</span>  <span id="inline-purple">__SC_CAST</span>  <span id="inline-blue">__SC_DECL</span> 以及 <span id="inline-green">__SC_LONG</span>
这些宏又是如何实现的：


<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__MAP</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">n</span>,...<span style="color: #cccccc;">)</span> __MAP##<span style="color: #f99157;">n</span><span style="color: #cccccc;">(</span>__VA_ARGS__<span style="color: #cccccc;">)</span>

<span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__MAP1</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">m</span>,<span style="color: #ffcc66;">t</span>,<span style="color: #ffcc66;">a</span><span style="color: #cccccc;">)</span> <span style="color: #f99157;">m</span><span style="color: #cccccc;">(</span>t,a<span style="color: #cccccc;">)</span>
<span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__MAP2</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">m</span>,<span style="color: #ffcc66;">t</span>,<span style="color: #ffcc66;">a</span>,...<span style="color: #cccccc;">)</span> <span style="color: #f99157;">m</span><span style="color: #cccccc;">(</span>t,a<span style="color: #cccccc;">)</span>, <span style="color: #f99157;">__MAP1</span><span style="color: #cccccc;">(</span>m,__VA_ARGS__<span style="color: #cccccc;">)</span>
<span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__MAP3</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">m</span>,<span style="color: #ffcc66;">t</span>,<span style="color: #ffcc66;">a</span>,...<span style="color: #cccccc;">)</span> <span style="color: #f99157;">m</span><span style="color: #cccccc;">(</span>t,a<span style="color: #cccccc;">)</span>, <span style="color: #f99157;">__MAP2</span><span style="color: #cccccc;">(</span>m,__VA_ARGS__<span style="color: #cccccc;">)</span>

<span style="color: #cc99cc;">#define</span> <span style="color: #f99157;">__SC_DECL</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">t</span>, <span style="color: #ffcc66;">a</span><span style="color: #cccccc;">)</span> <span style="color: #6699cc;">t</span> <span style="color: #ffcc66;">a</span>

<span style="color: #999999; font-style: italic;">/********************************************************************************************************************/</span>
<span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#23545;&#20110;__MAP(3, __SC_DECL, struct pollfd __user *, ufds, unsigned int, nfds, int, timeout_msecs)                    </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#23637;&#24320;&#21518;&#21363;&#20026; __SC_DECL(struct pollfd __user *, ufds), __MAP2(__SC_DECL, unsigned int, nfds, int, timeout_msecs)    </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#36827;&#19968;&#27493;&#23637;&#24320; __SC_DECL(struct pollfd __user *, ufds), __SC_DECL(unsigned int, nfds), __SC_DECL(int, timeout_msecs) </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#26368;&#32456;&#21363;&#20026; struct pollfd __user * ufds, unsigned int nfds, int timeout_msecs                                       </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #999999; font-style: italic;">/********************************************************************************************************************/</span>
</pre>
</div>

<p>
可见__MAP和__SC_DECL宏的主要作用是进行参数类型和参数的配对，而当和__SC_LONG配对使用时就是将所有的参数类型强转为long类型进行接受，这样转来转去为了啥？原因就是64位linux系统下有个名为CVE-2009-2009的漏洞，ABI规定在64位平台的在系统调用时，必须确保用户空间将系统调用中32位的参数存放在64位的寄存器中并保证正确的符合扩展，但是用户空间程序并不能保证做到这点，这就有可能向有漏洞的系统调用传送特制参数导致系统崩溃或者权限提升。
</p>

<blockquote>
<p>
ABI: Application Binary Interface, 定义了的内容大概有：
</p>
<ol class="org-ol">
<li>数据类型的大小，布局和对齐方式。</li>
<li>控制函数的参数如何进行传递以及如何接受返回值，例如，通过栈还是部分通过寄存器等。</li>
<li>应用如何使用系统调用。</li>
<li>目标文件的二进制格式，程序库等。</li>
</ol>
</blockquote>
</div>
</div>
