source/_posts/2017-03-02-linux-poll.org
* do_sys_poll
讲了这么多，才刚分析完sys_poll是如何定义的，sys_poll会调用do_sys_poll，接下来看do_sys_poll函数做了哪些事情:

- 将用户传入的pollfd数组拷贝到内核空间。
- 遍历查询传入的pollfd数组中文件描述符对应设备的状态，如果所有设备都没有关心的事件发生，这时则需要挂起当前进程，直到有事件到来或者超时将其唤醒。如果有事件到来，则再次遍历所有设备，定位事件。
- 将获得的事件返回到用户空间，并释放分配的内存以及移除等待队列。


#+BEGIN_SRC C
  int do_sys_poll(struct pollfd __user *ufds, unsigned int nfds,
                  struct timespec *end_time)
  {
      /* 1.执行拷贝动作 */
      ...

      /*2. 遍历查询 */
      poll_initwait(&table);
      fdcount = do_poll(nfds, head, &table, end_time)；

      /*3. 移除等待队列，释放内存，将事件拷贝回用户空间 */
      poll_freewait(&table);
      ...
  }

#+END_SRC



** 拷贝

在进行拷贝时，先申请一段栈空间，转换为poll_list类型，剩余的空间则被用来存放pollfd数组，在查询的文件描述符较少时，由于变量是存放在栈空间，
这样速度可以更快，而且可以节省memory。在文件描述符超过所申请的栈空间时，再额外的分配所需空间，完成剩下的拷贝工作。
#+BEGIN_SRC C
  long stack_pps[POLL_STACK_ALLOC/sizeof(long)];
  struct poll_list *const head = (struct poll_list *)stack_pps;
  struct poll_list *walk = head;
  unsigned long todo = nfds;

  for (;;) {
      walk->next = NULL;
      walk->len = len;
      if (!len)
          break;

      /* 拷贝pollfd数组到poll_list中的entries成员中 */
      if (copy_from_user(walk->entries, ufds + nfds-todo,
                          sizeof(struct pollfd) * walk->len))
          goto out_fds;

      /* todo初始值为要拷贝的文件描述符个数 */
      todo -= walk->len;
      if (!todo)
          break;

      len = min(todo, POLLFD_PER_PAGE);
      /* 当要查询的文件描述符大于预先在栈中申请的空间时，申请分配内存 */
      size = sizeof(struct poll_list) + sizeof(struct pollfd) * len;
      walk = walk->next = kmalloc(size, GFP_KERNEL);
      if (!walk) {
          err = -ENOMEM;
          goto out_fds;
      }
  }

#+END_SRC


** 查询事件

*** poll_initwait

初始化poll_wqueues变量table。
#+BEGIN_SRC C
  poll_initwait(struct poll_wqueues *pwq)
  {
      /* 将poll_table中的_qproc函数变量初始化为__pollwait，_key设置为(~0UL) */
      init_poll_funcptr(&pwq->pt, __pollwait);
      pwq->polling_task = current;
      pwq->triggered = 0;
      pwq->error = 0;
      pwq->table = NULL;
      pwq->inline_index = 0;
  }
#+END_SRC

__pollwait函数在驱动中的poll实现中通过poll_wait函数调用，这里先看下它的实现：

#+BEGIN_SRC C
  /* Add a new entry */
  static void __pollwait(struct file *filp, wait_queue_head_t *wait_address,
                         poll_table *p)
  {
      struct poll_wqueues *pwq = container_of(p, struct poll_wqueues, pt);
      struct poll_table_entry *entry = poll_get_entry(pwq);
      if (!entry)
          return;
      entry->filp = get_file(filp); //保存设备文件
      entry->wait_address = wait_address; //保存来自设备驱动的等待队列头
      entry->key = p->_key; //保存设备所关心的events
      /* 初始化等待队列项，并将唤醒该等待队列项的函数注册为pollwake */
      init_waitqueue_func_entry(&entry->wait, pollwake);
      entry->wait.private = pwq;
      /* 添加等待队列项到等待队列头 */
      add_wait_queue(wait_address, &entry->wait);
  }

#+END_SRC

