source/_posts/2017-03-02-linux-poll.html

<div id="org8c499fc" class="outline-2">
<h2 id="org8c499fc">do_sys_poll</h2>
<div class="outline-text-2" id="text-org8c499fc">
<p>
讲了这么多，才刚分析完sys_poll是如何定义的，sys_poll会调用do_sys_poll，接下来看do_sys_poll函数做了哪些事情:
</p>

<ul class="org-ul">
<li>将用户传入的pollfd数组拷贝到内核空间。</li>
<li>遍历查询传入的pollfd数组中文件描述符对应设备的状态，如果所有设备都没有关心的事件发生，这时则需要挂起当前进程，直到有事件到来或者超时将其唤醒。如果有事件到来，则再次遍历所有设备，定位事件。</li>
<li>将获得的事件返回到用户空间，并释放分配的内存以及移除等待队列。</li>
</ul>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">int</span> <span style="color: #f99157;">do_sys_poll</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> <span style="color: #6699cc;">__user</span> *<span style="color: #ffcc66;">ufds</span>, <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">nfds</span>,
                <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">timespec</span> *<span style="color: #ffcc66;">end_time</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">1.&#25191;&#34892;&#25335;&#36125;&#21160;&#20316; </span><span style="color: #999999; font-style: italic;">*/</span>
    ...

    <span style="color: #999999; font-style: italic;">/*</span><span style="color: #999999; font-style: italic;">2. &#36941;&#21382;&#26597;&#35810; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #f99157;">poll_initwait</span><span style="color: #66cccc;">(</span>&amp;table<span style="color: #66cccc;">)</span>;
    fdcount = <span style="color: #f99157;">do_poll</span><span style="color: #66cccc;">(</span>nfds, head, &amp;table, end_time<span style="color: #66cccc;">)</span>&#65307;

    <span style="color: #999999; font-style: italic;">/*</span><span style="color: #999999; font-style: italic;">3. &#31227;&#38500;&#31561;&#24453;&#38431;&#21015;&#65292;&#37322;&#25918;&#20869;&#23384;&#65292;&#23558;&#20107;&#20214;&#25335;&#36125;&#22238;&#29992;&#25143;&#31354;&#38388; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #f99157;">poll_freewait</span><span style="color: #66cccc;">(</span>&amp;table<span style="color: #66cccc;">)</span>;
    ...
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>



<div id="orgad94933" class="outline-3">
<h3 id="orgad94933">拷贝</h3>
<div class="outline-text-3" id="text-orgad94933">
<p>
在进行拷贝时，先申请一段栈空间，转换为poll_list类型，剩余的空间则被用来存放pollfd数组，在查询的文件描述符较少时，由于变量是存放在栈空间，这样速度可以更快，而且可以节省memory。在文件描述符超过所申请的栈空间时，再额外的分配所需空间，完成剩下的拷贝工作。
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">long</span> <span style="color: #ffcc66;">stack_pps</span><span style="color: #cccccc;">[</span>POLL_STACK_ALLOC/<span style="color: #f99157;">sizeof</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">long</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>;
<span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #99cc99;">const</span> <span style="color: #ffcc66;">head</span> = <span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #cccccc;">)</span>stack_pps;
<span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #ffcc66;">walk</span> = head;
<span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">long</span> <span style="color: #ffcc66;">todo</span> = nfds;

<span style="color: #99cc99;">for</span> <span style="color: #cccccc;">(</span>;;<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
    walk-&gt;next = <span style="color: #6699cc;">NULL</span>;
    walk-&gt;len = len;
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">!</span>len<span style="color: #66cccc;">)</span>
        <span style="color: #99cc99;">break</span>;

    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#25335;&#36125;pollfd&#25968;&#32452;&#21040;poll_list&#20013;&#30340;entries&#25104;&#21592;&#20013; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #f99157;">copy_from_user</span><span style="color: #ffcc66;">(</span>walk-&gt;entries, ufds + nfds-todo,
                        <span style="color: #f99157;">sizeof</span><span style="color: #99cc99;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span><span style="color: #99cc99;">)</span> * walk-&gt;len<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>
        <span style="color: #99cc99;">goto</span> <span style="color: #6699cc;">out_fds</span>;

    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">todo&#21021;&#22987;&#20540;&#20026;&#35201;&#25335;&#36125;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;&#20010;&#25968; </span><span style="color: #999999; font-style: italic;">*/</span>
    todo -= walk-&gt;len;
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">!</span>todo<span style="color: #66cccc;">)</span>
        <span style="color: #99cc99;">break</span>;

    len = <span style="color: #f99157;">min</span><span style="color: #66cccc;">(</span>todo, POLLFD_PER_PAGE<span style="color: #66cccc;">)</span>;
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#24403;&#35201;&#26597;&#35810;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;&#22823;&#20110;&#39044;&#20808;&#22312;&#26632;&#20013;&#30003;&#35831;&#30340;&#31354;&#38388;&#26102;&#65292;&#30003;&#35831;&#20998;&#37197;&#20869;&#23384; </span><span style="color: #999999; font-style: italic;">*/</span>
    size = <span style="color: #f99157;">sizeof</span><span style="color: #66cccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span><span style="color: #66cccc;">)</span> + <span style="color: #f99157;">sizeof</span><span style="color: #66cccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span><span style="color: #66cccc;">)</span> * len;
    walk = walk-&gt;next = <span style="color: #f99157;">kmalloc</span><span style="color: #66cccc;">(</span>size, GFP_KERNEL<span style="color: #66cccc;">)</span>;
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">!</span>walk<span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
        err = -ENOMEM;
        <span style="color: #99cc99;">goto</span> <span style="color: #6699cc;">out_fds</span>;
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>


<div id="orgf11d2a0" class="outline-3">
<h3 id="orgf11d2a0">查询事件</h3>
<div class="outline-text-3" id="text-orgf11d2a0">
</div><div id="orgf73b4a8" class="outline-4">
<h4 id="orgf73b4a8">poll_initwait</h4>
<div class="outline-text-4" id="text-orgf73b4a8">
<p>
初始化poll_wqueues变量table。
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #f99157;">poll_initwait</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_wqueues</span> *<span style="color: #ffcc66;">pwq</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#23558;poll_table&#20013;&#30340;_qproc&#20989;&#25968;&#21464;&#37327;&#21021;&#22987;&#21270;&#20026;__pollwait&#65292;_key&#35774;&#32622;&#20026;(~0UL) </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #f99157;">init_poll_funcptr</span><span style="color: #66cccc;">(</span>&amp;pwq-&gt;pt, __pollwait<span style="color: #66cccc;">)</span>;
    pwq-&gt;polling_task = current;
    pwq-&gt;triggered = <span style="color: #6699cc;">0</span>;
    pwq-&gt;error = <span style="color: #6699cc;">0</span>;
    pwq-&gt;table = <span style="color: #6699cc;">NULL</span>;
    pwq-&gt;inline_index = <span style="color: #6699cc;">0</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
__pollwait函数在驱动中的poll实现中通过poll_wait函数调用，这里先看下它的实现：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">Add a new entry </span><span style="color: #999999; font-style: italic;">*/</span>
<span style="color: #99cc99;">static</span> <span style="color: #6699cc;">void</span> <span style="color: #f99157;">__pollwait</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">file</span> *<span style="color: #ffcc66;">filp</span>, <span style="color: #6699cc;">wait_queue_head_t</span> *<span style="color: #ffcc66;">wait_address</span>,
                       <span style="color: #6699cc;">poll_table</span> *<span style="color: #ffcc66;">p</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_wqueues</span> *<span style="color: #ffcc66;">pwq</span> = <span style="color: #f99157;">container_of</span><span style="color: #66cccc;">(</span>p, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_wqueues</span>, pt<span style="color: #66cccc;">)</span>;
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_table_entry</span> *<span style="color: #ffcc66;">entry</span> = <span style="color: #f99157;">poll_get_entry</span><span style="color: #66cccc;">(</span>pwq<span style="color: #66cccc;">)</span>;
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">!</span>entry<span style="color: #66cccc;">)</span>
        <span style="color: #99cc99;">return</span>;
    entry-&gt;filp = <span style="color: #f99157;">get_file</span><span style="color: #66cccc;">(</span>filp<span style="color: #66cccc;">)</span>; <span style="color: #999999; font-style: italic;">//</span><span style="color: #999999; font-style: italic;">&#20445;&#23384;&#35774;&#22791;&#25991;&#20214;</span>
    entry-&gt;wait_address = wait_address; <span style="color: #999999; font-style: italic;">//</span><span style="color: #999999; font-style: italic;">&#20445;&#23384;&#26469;&#33258;&#35774;&#22791;&#39537;&#21160;&#30340;&#31561;&#24453;&#38431;&#21015;&#22836;</span>
    entry-&gt;key = p-&gt;_key; <span style="color: #999999; font-style: italic;">//</span><span style="color: #999999; font-style: italic;">&#20445;&#23384;&#35774;&#22791;&#25152;&#20851;&#24515;&#30340;events</span>
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#21021;&#22987;&#21270;&#31561;&#24453;&#38431;&#21015;&#39033;&#65292;&#24182;&#23558;&#21796;&#37266;&#35813;&#31561;&#24453;&#38431;&#21015;&#39033;&#30340;&#20989;&#25968;&#27880;&#20876;&#20026;pollwake </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #f99157;">init_waitqueue_func_entry</span><span style="color: #66cccc;">(</span>&amp;entry-&gt;wait, pollwake<span style="color: #66cccc;">)</span>;
    entry-&gt;wait.private = pwq;
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#28155;&#21152;&#31561;&#24453;&#38431;&#21015;&#39033;&#21040;&#31561;&#24453;&#38431;&#21015;&#22836; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #f99157;">add_wait_queue</span><span style="color: #66cccc;">(</span>wait_address, &amp;entry-&gt;wait<span style="color: #66cccc;">)</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>
