source/_posts/2017-03-02-linux-poll.org
*** do_poll

先上源码：

#+BEGIN_SRC C
  static int do_poll(unsigned int nfds,  struct poll_list *list,
             struct poll_wqueues *wait, struct timespec *end_time)
  {
      for (;;) {
          struct poll_list *walk;
          bool can_busy_loop = false;

          /* 遍历所有的pollfd */
          for (walk = list; walk != NULL; walk = walk->next) {
              struct pollfd * pfd, * pfd_end;

              pfd = walk->entries;
              pfd_end = pfd + walk->len;
              for (; pfd != pfd_end; pfd++) {
                  if (do_pollfd(pfd, pt, &can_busy_loop,
                            busy_flag)) {
                      count++;
                      pt->_qproc = NULL;
                      /* found something, stop busy polling */
                      busy_flag = 0;
                      can_busy_loop = false;
                  }
              }
          }

          pt->_qproc = NULL;
          ...

          if (!poll_schedule_timeout(wait, TASK_INTERRUPTIBLE, to, slack))
              timed_out = 1;
      }
  }

#+END_SRC

do_pollfd会调用到文件描述符所对应设备驱动程序中的poll函数指针，该函数相信很多人都知道怎么去写，但是为什么这样写，而且
它具体做了哪些事情，这里在内核目录下找了ucma的poll实现：

#+BEGIN_SRC C
  static unsigned int ucma_poll(struct file *filp, struct poll_table_struct *wait)
  {
      struct ucma_file *file = filp->private_data;
      unsigned int mask = 0;

      poll_wait(filp, &file->poll_wait, wait);

      if (!list_empty(&file->event_list))
          mask = POLLIN | POLLRDNORM;

      return mask;
  }

#+END_SRC

poll_wait()虽然具有wait字样，但是并不会阻塞在这里，不然如果应用程序同时监控多个设备文件，每个poll函数都阻塞的话，也不会
称为IO复用了。所以do_pollfd的真正作用有两个：
1. 利用poll_wait()将后续等待设备就绪的进程对应的等待队列项添加到驱动程序提供的等待队列头中。（仅在第一次轮循中使用，第一次轮循环结束后poll_table的_qproc被置为NULL）
2. 查询当前是否有关心的事件到来。

#+BEGIN_SRC C
  static inline void poll_wait(struct file * filp, wait_queue_head_t * wait_address, poll_table *p)
  {
      /* 在poll_initwait中_qproc指向__pollwait()函数 */
      if (p && p->_qproc && wait_address)
          p->_qproc(filp, wait_address, p);
  }


#+END_SRC

__pollwait()的实现详见上一小节，对于不同的进程当调用poll监测同一个设备文件描述符时都会有分配一个poll_table_entry项,并将等待队列项加入到相同的等待队列头中，都为
驱动程序中所初始化的等待队列头。因此当设备就绪时，就会唤醒所有在该等待队列头中的所有等待队列项。


若无事件发生，do_poll中的poll_schedule_timeout()会挂起当前进程，直到有事件（比如说POLLIN）到来时，可以通过wake_up_interruptible()"唤醒"处于设备驱动程序等待队列头的
等待队列项，这时会调用之前__pollwait注册的回调函数pollwake函数，它通过container_of找到等待队列项对应的poll_table_entry项，最后调用__pollwake真正唤醒当前挂起的进程。

#+BEGIN_SRC C
  static int pollwake(wait_queue_t *wait, unsigned mode, int sync, void *key)
  {
      struct poll_table_entry *entry;

      entry = container_of(wait, struct poll_table_entry, wait);
      if (key && !((unsigned long)key & entry->key))
          return 0;
      return __pollwake(wait, mode, sync, key);
  }
#+END_SRC

** 清理并返回用户空间


#+BEGIN_SRC C
  poll_freewait(&table);

  for (walk = head; walk; walk = walk->next) {
      struct pollfd *fds = walk->entries;
      int j;

      for (j = 0; j < walk->len; j++, ufds++)
          /* 拷贝回用户空间 */
          if (__put_user(fds[j].revents, &ufds->revents))
              goto out_fds;
  }

  err = fdcount;
  out_fds:
  walk = head->next;
  while (walk) {
      struct poll_list *pos = walk;
      walk = walk->next;
      kfree(pos);
  }

#+END_SRC
