source/_posts/2017-03-02-linux-poll.html

<div id="orgd57ceb1" class="outline-4">
<h4 id="orgd57ceb1">do_poll</h4>
<div class="outline-text-4" id="text-orgd57ceb1">
<p>
先上源码：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">static</span> <span style="color: #6699cc;">int</span> <span style="color: #f99157;">do_poll</span><span style="color: #cccccc;">(</span><span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">nfds</span>,  <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #ffcc66;">list</span>,
           <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_wqueues</span> *<span style="color: #ffcc66;">wait</span>, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">timespec</span> *<span style="color: #ffcc66;">end_time</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">for</span> <span style="color: #66cccc;">(</span>;;<span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
        <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #ffcc66;">walk</span>;
        <span style="color: #6699cc;">bool</span> <span style="color: #ffcc66;">can_busy_loop</span> = <span style="color: #6699cc;">false</span>;

        <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#36941;&#21382;&#25152;&#26377;&#30340;pollfd </span><span style="color: #999999; font-style: italic;">*/</span>
        <span style="color: #99cc99;">for</span> <span style="color: #ffcc66;">(</span>walk = list; walk != <span style="color: #6699cc;">NULL</span>; walk = walk-&gt;next<span style="color: #ffcc66;">)</span> <span style="color: #ffcc66;">{</span>
            <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> * <span style="color: #ffcc66;">pfd</span>, * <span style="color: #ffcc66;">pfd_end</span>;

            pfd = walk-&gt;entries;
            pfd_end = pfd + walk-&gt;len;
            <span style="color: #99cc99;">for</span> <span style="color: #99cc99;">(</span>; pfd != pfd_end; pfd++<span style="color: #99cc99;">)</span> <span style="color: #99cc99;">{</span>
                <span style="color: #99cc99;">if</span> <span style="color: #6699cc;">(</span><span style="color: #f99157;">do_pollfd</span><span style="color: #cccccc;">(</span>pfd, pt, &amp;can_busy_loop,
                          busy_flag<span style="color: #cccccc;">)</span><span style="color: #6699cc;">)</span> <span style="color: #6699cc;">{</span>
                    count++;
                    pt-&gt;_qproc = <span style="color: #6699cc;">NULL</span>;
                    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">found something, stop busy polling </span><span style="color: #999999; font-style: italic;">*/</span>
                    busy_flag = <span style="color: #6699cc;">0</span>;
                    can_busy_loop = <span style="color: #6699cc;">false</span>;
                <span style="color: #6699cc;">}</span>
            <span style="color: #99cc99;">}</span>
        <span style="color: #ffcc66;">}</span>

        pt-&gt;_qproc = <span style="color: #6699cc;">NULL</span>;
        ...

        <span style="color: #99cc99;">if</span> <span style="color: #ffcc66;">(</span><span style="color: #6699cc;">!</span><span style="color: #f99157;">poll_schedule_timeout</span><span style="color: #99cc99;">(</span>wait, TASK_INTERRUPTIBLE, to, slack<span style="color: #99cc99;">)</span><span style="color: #ffcc66;">)</span>
            timed_out = <span style="color: #6699cc;">1</span>;
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
do_pollfd会调用到文件描述符所对应设备驱动程序中的poll函数指针，该函数相信很多人都知道怎么去写，但是为什么这样写，而且它具体做了哪些事情，这里在内核目录下找了ucma的poll实现：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">static</span> <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span> <span style="color: #f99157;">ucma_poll</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">file</span> *<span style="color: #ffcc66;">filp</span>, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_table_struct</span> *<span style="color: #ffcc66;">wait</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">ucma_file</span> *<span style="color: #ffcc66;">file</span> = filp-&gt;private_data;
    <span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">mask</span> = <span style="color: #6699cc;">0</span>;

    <span style="color: #f99157;">poll_wait</span><span style="color: #66cccc;">(</span>filp, &amp;file-&gt;poll_wait, wait<span style="color: #66cccc;">)</span>;

    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">!</span><span style="color: #f99157;">list_empty</span><span style="color: #ffcc66;">(</span>&amp;file-&gt;event_list<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>
        mask = POLLIN | POLLRDNORM;

    <span style="color: #99cc99;">return</span> mask;
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
poll_wait()虽然具有wait字样，但是并不会阻塞在这里，不然如果应用程序同时监控多个设备文件，每个poll函数都阻塞的话，也不会称为IO复用了。所以do_pollfd的真正作用有两个：
</p>
<ol class="org-ol">
<li>利用poll_wait()将后续等待设备就绪的进程对应的等待队列项添加到驱动程序提供的等待队列头中。（仅在第一次轮循中使用，第一次轮循环结束后poll_table的_qproc被置为NULL）</li>
<li>查询当前是否有关心的事件到来。</li>
</ol>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">static</span> <span style="color: #99cc99;">inline</span> <span style="color: #6699cc;">void</span> <span style="color: #f99157;">poll_wait</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">file</span> * <span style="color: #ffcc66;">filp</span>, <span style="color: #6699cc;">wait_queue_head_t</span> * <span style="color: #ffcc66;">wait_address</span>, <span style="color: #6699cc;">poll_table</span> *<span style="color: #ffcc66;">p</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#22312;poll_initwait&#20013;_qproc&#25351;&#21521;__pollwait()&#20989;&#25968; </span><span style="color: #999999; font-style: italic;">*/</span>
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span>p &amp;&amp; p-&gt;_qproc &amp;&amp; wait_address<span style="color: #66cccc;">)</span>
        p-&gt;<span style="color: #f99157;">_qproc</span><span style="color: #66cccc;">(</span>filp, wait_address, p<span style="color: #66cccc;">)</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
__pollwait()的实现详见上一小节，对于不同的进程当调用poll监测同一个设备文件描述符时都会有分配一个poll_table_entry项,并将等待队列项加入到相同的等待队列头中，都为驱动程序中所初始化的等待队列头。因此当设备就绪时，就会唤醒所有在该等待队列头中的所有等待队列项。
</p>


<p>
若无事件发生，do_poll中的poll_schedule_timeout()会挂起当前进程，直到有事件（比如说POLLIN）到来时，可以通过wake_up_interruptible()"唤醒"处于设备驱动程序等待队列头的等待队列项，这时会调用之前__pollwait注册的回调函数pollwake函数，它通过container_of找到等待队列项对应的poll_table_entry项，最后调用__pollwake真正唤醒当前挂起的进程。
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">static</span> <span style="color: #6699cc;">int</span> <span style="color: #f99157;">pollwake</span><span style="color: #cccccc;">(</span><span style="color: #6699cc;">wait_queue_t</span> *<span style="color: #ffcc66;">wait</span>, <span style="color: #6699cc;">unsigned</span> <span style="color: #ffcc66;">mode</span>, <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">sync</span>, <span style="color: #6699cc;">void</span> *<span style="color: #ffcc66;">key</span><span style="color: #cccccc;">)</span>
<span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_table_entry</span> *<span style="color: #ffcc66;">entry</span>;

    entry = <span style="color: #f99157;">container_of</span><span style="color: #66cccc;">(</span>wait, <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_table_entry</span>, wait<span style="color: #66cccc;">)</span>;
    <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span>key &amp;&amp; <span style="color: #6699cc;">!</span><span style="color: #ffcc66;">(</span><span style="color: #99cc99;">(</span><span style="color: #6699cc;">unsigned</span> <span style="color: #6699cc;">long</span><span style="color: #99cc99;">)</span>key &amp; entry-&gt;key<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>
        <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">0</span>;
    <span style="color: #99cc99;">return</span> <span style="color: #f99157;">__pollwake</span><span style="color: #66cccc;">(</span>wait, mode, sync, key<span style="color: #66cccc;">)</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="org2a1e886" class="outline-3">
<h3 id="org2a1e886">清理并返回用户空间</h3>
<div class="outline-text-3" id="text-org2a1e886">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #f99157;">poll_freewait</span><span style="color: #cccccc;">(</span>&amp;table<span style="color: #cccccc;">)</span>;

<span style="color: #99cc99;">for</span> <span style="color: #cccccc;">(</span>walk = head; walk; walk = walk-&gt;next<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">pollfd</span> *<span style="color: #ffcc66;">fds</span> = walk-&gt;entries;
    <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">j</span>;

    <span style="color: #99cc99;">for</span> <span style="color: #66cccc;">(</span>j = <span style="color: #6699cc;">0</span>; j &lt; walk-&gt;len; j++, ufds++<span style="color: #66cccc;">)</span>
        <span style="color: #999999; font-style: italic;">/* </span><span style="color: #999999; font-style: italic;">&#25335;&#36125;&#22238;&#29992;&#25143;&#31354;&#38388; </span><span style="color: #999999; font-style: italic;">*/</span>
        <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span><span style="color: #f99157;">__put_user</span><span style="color: #ffcc66;">(</span>fds<span style="color: #99cc99;">[</span>j<span style="color: #99cc99;">]</span>.revents, &amp;ufds-&gt;revents<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>
            <span style="color: #99cc99;">goto</span> <span style="color: #6699cc;">out_fds</span>;
<span style="color: #cccccc;">}</span>

err = fdcount;
<span style="color: #6699cc;">out_fds</span>:
walk = head-&gt;next;
<span style="color: #99cc99;">while</span> <span style="color: #cccccc;">(</span>walk<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">poll_list</span> *<span style="color: #ffcc66;">pos</span> = walk;
    walk = walk-&gt;next;
    <span style="color: #f99157;">kfree</span><span style="color: #66cccc;">(</span>pos<span style="color: #66cccc;">)</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>
</div>
